HL7v2.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
<soap:Body xmlns:m="http://192.168.163.129/medical_warehouse/warehouse.php">
  <m:ingest_file>
    <m:clientId>SamTest</m:clientId>
    <m:format>DICOM</m:format>
    <m:payload><![CDATA[<data>data1</data>
     <data2>tre</data2>
       ]]></m:payload>
  </m:ingest_file>
</soap:Body>
</soap:Envelope>